* Two Sum
给定一个整数数组和一个目标值，找出数组中和为目标值的两个数。
你可以假设每个输入只对应一种答案，且同样的元素不能被重复利用。

#+BEGIN_EXAMPLE
给定 nums = [2, 7, 11, 15], target = 9

因为 nums[0] + nums[1] = 2 + 7 = 9
所以返回 [0, 1]
#+END_EXAMPLE

#+BEGIN_SRC C++
  #include <unordered_map>
  #include <iostream>
  #include <vector>

  using namespace std;

  class Solution {
  public:
    vector<int> twoSum(vector<int>& nums, int target) {
      unordered_map<int, int> m;
      vector<int> result;
      for(int i = 0; i<nums.size(); i++){
        // 找不到第二个
        if (m.find(nums[i]) == m.end() ) { 
          // 存储第一个值作为第二个的键
          m[target - nums[i]] = i; 
        }else { 
          // 找到第二个
          result.push_back(m[nums[i]]);
          result.push_back(i);
          break;
        }
      }
      return result;
    }
  };

  int main() {
    int nums_array[] = {11, 7, 2, 15};
    vector<int> nums(nums_array, nums_array + 4);
    int target = 9;
    Solution solution;
    auto result =   solution.twoSum(nums, target);
    for (auto i = 0; i < result.size(); ++i) {
      cout << result[i] << " ";
    }
    return 0;
  }
#+END_SRC 

#+RESULTS:
: 1 2

* 两数相加
给定两个非空链表来表示两个非负整数。位数按照逆序方式存储，它们的每个节点只存储单个数字。将两数相加返回一个新的链表。
你可以假设除了数字 0 之外，这两个数字都不会以零开头。

#+BEGIN_EXAMPLE
输入：(2 -> 4 -> 3) + (5 -> 6 -> 4)
输出：7 -> 0 -> 8
原因：342 + 465 = 807
#+END_EXAMPLE

#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;

  struct ListNode {
    int val;
    ListNode *next;
    ListNode(int x) : val(x), next(NULL) {}
  };

  class Solution {
  public:
    ListNode *addTwoNumbers(ListNode *l1, ListNode *l2) {
      int x = 0, y = 0, carry = 0, sum = 0;
      ListNode *h = NULL, **t = &h;

      while (l1 != NULL || l2 != NULL) {
        x = getValueAndMoveNext(l1);
        y = getValueAndMoveNext(l2);

        sum = carry + x + y;

        ListNode *node = new ListNode(sum % 10);
        ,*t = node;
        t = (&node->next);

        carry = sum / 10;
      }

      if (carry > 0) {
        ListNode *node = new ListNode(carry % 10);
        ,*t = node;
      }

      return h;
    }

  private:
    int getValueAndMoveNext(ListNode *&l) {
      int x = 0;
      if (l != NULL) {
        x = l->val;
        l = l->next;
      }
      return x;
    }
  };

  ListNode *createList(int arr[], int len) {
    if (len == 0) {
      return nullptr;
    }
  
    ListNode *list = new ListNode(arr[0]);
    ListNode *temp = list;

    for (auto i = 1; i < len; ++i) {
      temp->next = new ListNode(arr[i]);
      temp = temp->next;
    }
    return list;
  }

  int main(int argc, char *argv[]) {
    int arr1[] = {2, 4, 3};
    ListNode *l1 = createList(arr1, 3);
    int arr2[] = {5, 6, 4};
    ListNode *l2 = createList(arr2, 3);
    Solution solution;
    ListNode *l = solution.addTwoNumbers(l1, l2);

    while (l) {
      cout << l->val << " ";
      l = l->next;
    }
    return 0;
  }

#+END_SRC

#+RESULTS:
: 7 0 8

* 无重复字串的最长子串
给定一个字符串，找出不含有重复字符的最长子串的长度。

使用 map 存储字符串的索引

#+BEGIN_SRC C++
#include <iostream>
#include <string>
#include <map>
using namespace std;

class Solution {
public:
    int lengthOfLongestSubstring(string s) {
      map<char, int> m;
      int nextRepeatPos= -1;
      int maxLen = 0;
      for (auto i = 0; i < s.size(); ++i) {
        if (m.find(s[i]) != m.end() && nextRepeatPos < m[s[i]]) {
          nextRepeatPos = m[s[i]];
        }
        if (i - nextRepeatPos > maxLen) {
          maxLen = i - nextRepeatPos;
        }
        m[s[i]] = i;
      }
      return maxLen;
    }
};

int main(int argc, char *argv[]) {
  Solution solution;
  cout << solution.lengthOfLongestSubstring(string("abba")) << endl;
  return 0;
}

#+END_SRC 

#+RESULTS:
: 2
* 两个排序数组的中位数
给定两个大小为 m 和 n 的有序数组 nums1 和 nums2 。
请找出这两个有序数组的中位数。要求算法的时间复杂度为 O(log (m+n)) 。
你可以假设 nums1 和 nums2 不同时为空。

#+BEGIN_EXAMPLE
// example
nums1 = [1, 3]
nums2 = [2]

中位数是 2.0

// example
nums1 = [1, 2]
nums2 = [3, 4]

中位数是 (2 + 3)/2 = 2.5
#+END_EXAMPLE

#+BEGIN_SRC C++
#include <iostream>
#include <vector>

using namespace std;

class Solution {
public:
  double findMedianSortedArrays(vector<int> &nums1, vector<int> &nums2) {
    int m = nums1.size();
    int n = nums2.size();
    if (m > n) { // to ensure m <= n
      swap(nums1, nums2);
      swap(m, n);
    }

    int iMin = 0, iMax = m, halfLen = (m + n + 1) / 2;
    while (iMin <= iMax) {
      int leftHalf = (iMin + iMax) / 2;
      int rightHalf = halfLen - leftHalf;
      
      if (leftHalf < iMax && nums2[rightHalf - 1] > nums1[leftHalf]) {
        iMin = leftHalf + 1;
      } else if (leftHalf > iMin && nums1[leftHalf - 1] > nums2[rightHalf]) {
        iMax = leftHalf - 1;
      } else {
        int maxLeft = 0;
        if (leftHalf == 0) maxLeft = nums2[rightHalf - 1];
        else if (rightHalf == 0) maxLeft = nums1[leftHalf - 1];
        else maxLeft = max(nums1[leftHalf - 1], nums2[rightHalf - 1]);
        if ((m + n) % 2 == 1) return maxLeft;

        int minRight = 0;
        if (leftHalf == m) minRight = nums2[rightHalf];
        else if (rightHalf == n) minRight = nums1[leftHalf];
        else minRight = min(nums2[rightHalf], nums1[leftHalf]);
        return (maxLeft + minRight) / 2.0;
      }
    }
    return 0.0;
  }
};

int main(int argc, char *argv[]) {
  Solution solution;
  vector<int> nums1 = {1, 3};
  vector<int> nums2 = {2};
  cout << solution.findMedianSortedArrays(nums1, nums2) << endl;
  return 0;
}

#+END_SRC 

#+RESULTS:
: 2
* 反转整数
给定一个 32 位有符号整数，将整数中的数字进行反转。

#+BEGIN_EXAMPLE
示例   1     2    3
输入: 123  -123  120
输出: 321  -321  21
#+END_EXAMPLE

假设我们的环境只能存储 32 位有符号整数，其数值范围是 $[−2^{31}, 2^{31}-1]$ 。根据这个假设，如果反转后的整数溢出，则返回 0。

#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;
  #define INT_MAX 2147483647
  #define INT_MIN (-INT_MAX - 1)
  class Solution {
  public:
    int reverse(int x) {
      int y = 0;
      int n;
      while(x != 0) {
        n = x % 10;
        if (y > INT_MAX / 10 || y < INT_MIN / 10) {
          return 0;
        }
        y = y * 10 + n;
        x /= 10;
      }
      return y;
    }
  };
  int main(int argc, char *argv[]) {
    Solution solution;
    cout << solution.reverse(1534236469) << endl;
    return 0;
  }
#+END_SRC 

#+RESULTS:
: 0
* 回文数
判断一个整数是否是回文数。回文数是指正序 (从左向右) 和倒序 (从右向左) 读都是一样的整数。

#+BEGIN_SRC C++
  #include <iostream>
  bool isPalindrome(int x) {
    if (x < 0 || (x % 10 == 0 && x != 0)) {
      return false;
    }
    int revertedNumber;
    while (x > revertedNumber) {
      revertedNumber = revertedNumber * 10 + x % 10;
      x /= 10;
    }
    return x == revertedNumber || x == revertedNumber / 10;
  }
  int main(int argc, char *argv[]) {
    std::cout << isPalindrome(12321) << '\n';
    return 0;
  }
#+END_SRC

#+RESULTS:
: 1
